package module7;

/**
 Найти и описать анти-паттерны в своём коде и предложить вариант их исправления.
 Формат описания - комментарии в исходном коде с предложениями их решения.
 Решение обсудить с ментором и только ПОСЛЕ этого изменять код.

 РЕШЕНИЕ:
 1. Удадил все повторяющиеся классы и модули из проекта ('COPY & PASTE PROGRAMMING' ANTI-PATTERN)
 2. Зампенил ввод чисел в методах на ввод через чтение с файла и чтение с консоли ('MAGIC NUMBERS'  ANTI-PATTERN)
 3. Удалил заполнение массива и ArrayList через for-each + Math.random ('GOLDEN HAMMER' ANTI-PATTERN)
 */
class Main {

}
